ehunck/automatic-midi-bells/USBPhy_M252.cpp
/* mbed Microcontroller Library
 * Copyright (c) 2019-2020 ARM Limited
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "USBPhyHw.h"

#include "mbed_critical.h"

#define NUMBER_OF_LOGICAL_ENDPOINTS (12)
#define NUMBER_OF_PHYSICAL_ENDPOINTS (NUMBER_OF_LOGICAL_ENDPOINTS)
#define ALLOW_ALL_EXCEPT_CRTL        (USB_EP_ATTR_ALLOW_BULK | USB_EP_ATTR_ALLOW_INT | USB_EP_ATTR_ALLOW_ISO)
#define ALLOW_NO_ENDPOINTS 0

static USBPhyHw *instance;

#define MBED_CONF_TARGET_USB_DEVICE_HSUSBD 0  /* USB 1.1 Only */
#define USBD_SET_ADDRESS         0x05ul

extern "C" void USBD_IRQHandler(void);

//#define NVT_USB_Debug(x) { mbed_error_printf x;}
#define NVT_USB_Debug(x)

void chip_config(void)
{
	SYS_UnlockReg();

    /* Enable Internal HIRC 48 MHz clock */
    CLK_EnableXtalRC(CLK_PWRCTL_HIRCEN_Msk);

    /* Waiting for Internal RC clock ready */
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

    /* Switch HCLK clock source to Internal HIRC and HCLK source divide 1 */
    CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_HIRC, CLK_CLKDIV0_HCLK(1));

    /* Select module clock source */
    CLK_SetModuleClock(USBD_MODULE, CLK_CLKSEL0_USBDSEL_HIRC, CLK_CLKDIV0_USB(1));

    /* Enable module clock */
	CLK_EnableModuleClock(USBD_MODULE);

}

#if (MBED_CONF_TARGET_USB_DEVICE_HSUSBD == 0)

// Conversion macros
#define DESC_TO_LOG(endpoint)   ((endpoint) & 0xF)
#define NU_EPH2EPL(ep)           ep
#define NU_EPL2EPH(ep)           ep
#define HW_TO_DESC(endpoint) (endpoint|(((endpoint&1)?0x0:0x80)))

/* Global variables for Control Pipe */
//#if defined(TARGET_M2351) || defined(TARGET_M261) || defined(TARGET_M2354)
extern uint8_t g_USBD_au8SetupPacket[];        /*!< Setup packet buffer */
uint8_t* g_usbd_SetupPacket=g_USBD_au8SetupPacket;
//#else
//extern uint8_t g_usbd_SetupPacket[];        /*!< Setup packet buffer */
//#endif

#define CEP_BUF_BASE 8
#define MAX_CEP_SIZE 64

static volatile uint32_t s_ep_compl = 0;
static volatile uint32_t s_ep_buf_ind = 8;
static volatile uint32_t s_ep0_max_packet_size = MAX_CEP_SIZE;
static volatile uint8_t s_usb_addr = 0;
static volatile uint8_t s_ep_data_bit[NUMBER_OF_PHYSICAL_ENDPOINTS] = {1};
static volatile uint8_t s_ep_mxp[NUMBER_OF_PHYSICAL_ENDPOINTS] = {0};
volatile uint8_t s_ep_valid[NUMBER_OF_PHYSICAL_ENDPOINTS] = {0};
extern volatile uint8_t *g_usbd_CtrlInPointer;
extern volatile uint32_t g_usbd_CtrlInSize;
extern volatile uint8_t *g_usbd_CtrlOutPointer;
extern volatile uint32_t g_usbd_CtrlOutSize;
extern volatile uint32_t g_usbd_CtrlOutSizeLimit;
extern volatile uint32_t g_usbd_UsbConfig;
extern volatile uint32_t g_usbd_CtrlMaxPktSize;
extern volatile uint32_t g_usbd_UsbAltInterface;
volatile uint32_t g_usbd_CepTransferLen = 0;
volatile uint32_t frame_cnt = 0;


USBPhy *get_usb_phy()
{
    static USBPhyHw usbphy;
    NVT_USB_Debug(("### %s\n", __FUNCTION__));
    return &usbphy;
}

USBPhyHw::USBPhyHw(): events(NULL)
{

}

USBPhyHw::~USBPhyHw()
{

}

/*
  Initialize this USBPhy instance.
  This function must be called before calling any other functions of this class, unless specifically noted.
*/
void USBPhyHw::init(USBPhyEvents *events)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    if (this->events == NULL) {
        sleep_manager_lock_deep_sleep();
    }
    this->events = events;
#if defined(TARGET_M2354)
    wait_us(10);    /* To init us_ticker to avoid invoking NSC for us_ticker, it could keep wait_us safe from ISR Context */
    SYS_UnlockReg_S();
#else
    SYS_UnlockReg();
#endif
    s_ep_buf_ind = 0;

    chip_config();

    /* Initial USB engine */
#if defined (TARGET_NANO100)
    USBD->CTL = 0x29f;
    USBD->PDMA |= USBD_PDMA_BYTEM_Msk;
#else
    USBD->ATTR = 0x7D0;
#endif
    /* Set SE0 (disconnect) */
    USBD_SET_SE0();

    NVIC_SetVector(USBD_IRQn, (uint32_t) &USBD_IRQHandler);
    NVIC_EnableIRQ(USBD_IRQn);

    instance = this;
}

void USBPhyHw::deinit()
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    NVIC_DisableIRQ(USBD_IRQn);
    USBD_SET_SE0();
    USBD_DISABLE_PHY();

    if (events != NULL)
    {
        sleep_manager_unlock_deep_sleep();
    }
    events = NULL;
}

/*
  Check if USB power is present.
  Devices which don't support checking the USB power state must always return true.
*/
bool USBPhyHw::powered()
{
    return true;
}

void EpInit(void);

void USBPhyHw::connect()
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));

    memset(read_buffers, 0, sizeof(read_buffers));
    memset(read_sizes, 0, sizeof(read_sizes));

    s_ep_compl = 0;

    EpInit();
    /* Disable software-disconnect function */
    USBD_CLR_SE0();

    /* Clear USB-related interrupts before enable interrupt */
    USBD_CLR_INT_FLAG(USBD_INT_BUS | USBD_INT_USB | USBD_INT_FLDET | USBD_INT_WAKEUP);

    /* Enable USB-related interrupts. */
    USBD_ENABLE_INT(USBD_INT_BUS | USBD_INT_USB | USBD_INT_FLDET | USBD_INT_WAKEUP);
}

/* Make the USB phy visible to the USB host.
   Enable either the D+ or D- pullup so the host can detect the presence of this device. */
void USBPhyHw::disconnect()
{
    uint32_t volatile i = 0;
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
#if 1
#if defined (TARGET_NANO100)
    SYS->IPRST_CTL2 = SYS_IPRST_CTL2_USBD_RST_Msk;
#else
    SYS->IPRST1 =  SYS_IPRST1_USBDRST_Msk;
#endif
    for(i=0;i<1000;i++)
        ;

#if defined (TARGET_NANO100)
    SYS->IPRST_CTL2 = 0;
#else
    SYS->IPRST1 =  0;
#endif

