ehunck/automatic-midi-bells/USBPhy_M252.cpp
    s_ep_buf_ind = 0;

    /* Initial USB engine */
#if defined (TARGET_NANO100)
    USBD->CTL = 0x29f;
    USBD->PDMA |= USBD_PDMA_BYTEM_Msk;
#else
    USBD->ATTR = 0x7D0;
#endif
#endif
    /* Set SE0 (disconnect) */
    USBD_SET_SE0();

    memset(read_buffers, 0, sizeof(read_buffers));
    memset(read_sizes, 0, sizeof(read_sizes));

    frame_cnt = 0;

    EpInit();

    /* Clear USB-related interrupts before disable interrupt */
    USBD_CLR_INT_FLAG(USBD_INT_BUS | USBD_INT_USB | USBD_INT_FLDET | USBD_INT_WAKEUP);

    /* Disable USB-related interrupts. */
    USBD->INTEN = 0;
}


void EpInit(void)
{
    uint32_t volatile i = 0;
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));

    /* Init setup packet buffer */
    USBD->STBUFSEG = 0;

    memset((void *)s_ep_valid, 0, sizeof(s_ep_valid));

    /* EP0 ==> control IN endpoint, address 0 */
    USBD_CONFIG_EP(EP0, USBD_CFG_CSTALL | USBD_CFG_EPMODE_IN | 0);

    /* Buffer range for EP0 */
    USBD_SET_EP_BUF_ADDR(EP0, CEP_BUF_BASE);

    /* EP1 ==> control OUT endpoint, address 0 */
    USBD_CONFIG_EP(EP1, USBD_CFG_CSTALL | USBD_CFG_EPMODE_OUT | 0);

    /* Buffer range for EP1 */
    USBD_SET_EP_BUF_ADDR(EP1, CEP_BUF_BASE);

    s_ep_buf_ind = CEP_BUF_BASE + MAX_CEP_SIZE;

    for(i=2;i<NUMBER_OF_PHYSICAL_ENDPOINTS;i++)
    {
        USBD_SET_EP_BUF_ADDR(i, s_ep_buf_ind);
        s_ep_buf_ind += 64;
    }
}

/* Set this device to the configured state.
   Enable added endpoints if they are not enabled already. */
void USBPhyHw::configure()
{
    // not needed
}

/*
   Leave the configured state.
   This is a notification to the USBPhy indicating that the device is leaving the configured state. The USBPhy can disable all endpoints other than endpoint 0.
*/
void USBPhyHw::unconfigure()
{

}

/* Enable the start of frame interrupt. */
void USBPhyHw::sof_enable()
{

}

/* Disable the start of frame interrupt. */
void USBPhyHw::sof_disable()
{

}

/* Set the USBPhy's address. */
void USBPhyHw::set_address(uint8_t address)
{
    s_usb_addr = address;
}

/* Wake upstream devices */
void USBPhyHw::remote_wakeup()
{
//#if defined (TARGET_NANO100)
//    USBD->CTL |= USBD_CTL_RWAKEUP_Msk;
//#else
//    USBD->ATTR |= USBD_ATTR_RWAKEUP_Msk;
//#endif
}

/*
  Get the endpoint table.
  This function returns a table which describes the endpoints can be used, the functionality of those endpoints and the resource cost.
*/
const usb_ep_table_t *USBPhyHw::endpoint_table()
{
    static const usb_ep_table_t endpoint_table = {
        1, // No cost per endpoint - everything allocated up front
        {
            {USB_EP_ATTR_ALLOW_CTRL | USB_EP_ATTR_DIR_IN_AND_OUT, 0, 0},
            {USB_EP_ATTR_ALLOW_CTRL | USB_EP_ATTR_DIR_IN_AND_OUT, 0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
//#if (!TARGET_M451)
//            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
//            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
//            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
//            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
//            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
//            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
//            {ALLOW_NO_ENDPOINTS | USB_EP_ATTR_DIR_IN,             0, 0},
//            {ALLOW_NO_ENDPOINTS | USB_EP_ATTR_DIR_OUT,            0, 0},
//#endif
        }
    };
    return &endpoint_table;
}
/*
  Set wMaxPacketSize of endpoint 0.
 */
uint32_t USBPhyHw::ep0_set_max_packet(uint32_t max_packet)
{
    s_ep0_max_packet_size = max_packet;
    return s_ep0_max_packet_size;
}

/* Read the contents of the SETUP packet. */
void USBPhyHw::ep0_setup_read_result(uint8_t *buffer, uint32_t size)
{
    USBD_MemCopy(g_usbd_SetupPacket, (uint8_t *)USBD_BUF_BASE, 8);
    if (buffer)
        USBD_MemCopy(buffer, g_usbd_SetupPacket, 8);
    USBD_SET_PAYLOAD_LEN(EP1, s_ep0_max_packet_size);
}

/*
  Start receiving a packet of up to wMaxPacketSize on endpoint 0.
*/
void USBPhyHw::ep0_read(uint8_t *data, uint32_t size)
{
    read_buffers[0] = data;
    read_sizes[0] = size;
}
/*
  Read the contents of a received packet.
*/
uint32_t USBPhyHw::ep0_read_result()
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t i;
    uint8_t *buf = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP1));
    uint8_t *buffer = read_buffers[0];
    uint32_t ceprxcnt = USBD_GET_PAYLOAD_LEN(EP1);
    if(buffer)
    {
        for (i = 0; i < ceprxcnt; i ++)
            buffer[i] = buf[i];
    }
    USBD_SET_PAYLOAD_LEN(EP1, read_sizes[0]);
    if(read_sizes[0] == 0)
        ceprxcnt = 0;
    read_buffers[0] = 0;
    read_sizes[0] = 0;
    return ceprxcnt;
}

/* Write a packet on endpoint 0. */
void USBPhyHw::ep0_write(uint8_t *buffer, uint32_t size)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    if (buffer && size)
    {
        NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
        if(s_ep_data_bit[0] & 1)
            USBD_SET_DATA1(EP0);
        else
            USBD_SET_DATA0(EP0);
        s_ep_data_bit[0]++;
        USBD_MemCopy((uint8_t *)USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0), buffer, size);
        USBD_SET_PAYLOAD_LEN(EP0, size);
        if(size < s_ep0_max_packet_size)
            s_ep_data_bit[0] = 1;
    }
    else
    {
        NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
        s_ep_data_bit[0] = 1;
        USBD_SET_DATA1(EP0);
        wait_us(500);
        USBD_SET_PAYLOAD_LEN(EP0, 0);

        if((USBD->EPSTS & 0xF) == 0x00)    /* NAK */
            USBD_SET_PAYLOAD_LEN(EP0, 0);
    }
}

void stallEndpoint(uint8_t endpoint)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    if (ep_logic_index >= NUMBER_OF_LOGICAL_ENDPOINTS)
        return;

    USBD_SetStall(ep_logic_index);
}

/* Protocol stall on endpoint 0.
   Stall all IN and OUT packets on endpoint 0 until a setup packet is received.
   Note The stall is cleared automatically when a setup packet is received
*/
void USBPhyHw::ep0_stall()
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    stallEndpoint(0);
    stallEndpoint(1);
}

