ehunck/automatic-midi-bells/USBPhy_M252.cpp
/* Configure and enable an endpoint. */
/*
   endpoint	Endpoint to configure and enable
   max_packet	The maximum packet size that can be sent or received
   type	The type of endpoint this should be configured as - USB_EP_TYPE_BULK, USB_EP_TYPE_INT or USB_EP_TYPE_ISO
   This function cannot be used to configure endpoint 0. That must be done with ep0_set_max_packet
*/
bool USBPhyHw::endpoint_add(usb_ep_t endpoint, uint32_t max_packet, usb_ep_type_t type)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t ep_type = 0;
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
    uint32_t ep_dir = (endpoint & 0x80) ? USBD_CFG_EPMODE_IN : USBD_CFG_EPMODE_OUT;

    if(type == USB_EP_TYPE_ISO)
        ep_type = USBD_CFG_TYPE_ISO;

    USBD_CONFIG_EP(ep_hw_index, ep_dir | ep_type | ep_logic_index);

    /* Buffer range */
//    USBD_SET_EP_BUF_ADDR(ep_hw_index, s_ep_buf_ind);

    s_ep_mxp[ep_logic_index] = max_packet;
//    s_ep_buf_ind += max_packet;
    s_ep_valid[ep_logic_index] = 1;
    return true;
}

void USBPhyHw::endpoint_remove(usb_ep_t endpoint)
{

}

/*
  Perform a functional stall on the given endpoint.
  Set the HALT feature for this endpoint so that all further communication is aborted.
*/
void USBPhyHw::endpoint_stall(usb_ep_t endpoint)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    USBD_SetStall(DESC_TO_LOG(endpoint));
}

/*
   Unstall the endpoint.
   Clear the HALT feature on this endpoint so communication can resume.
 */
void USBPhyHw::endpoint_unstall(usb_ep_t endpoint)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
    if (ep_logic_index >= NUMBER_OF_LOGICAL_ENDPOINTS)
        return;
    USBD_ClearStall(ep_logic_index);
    USBD_SET_DATA0(ep_hw_index);
    s_ep_compl &= ~(1 << ep_logic_index);
    s_ep_valid[ep_logic_index] = 1;
}

/* Start a read on the given endpoint. */
bool USBPhyHw::endpoint_read(usb_ep_t endpoint, uint8_t *data, uint32_t size)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    /* Store the buffer address & length */
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
    USBD_SET_PAYLOAD_LEN(ep_hw_index,s_ep_mxp[ep_logic_index]);
    read_buffers[ep_logic_index] = data;
    read_sizes[ep_logic_index] = size;
    return true;
}

/*
  Finish a read on the given endpoint
  Returns The number of bytes received
*/
uint32_t USBPhyHw::endpoint_read_result(usb_ep_t endpoint)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint8_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t bytes_read = 0;
    endpoint_read_result_core(endpoint, read_buffers[ep_logic_index], read_sizes[ep_logic_index], &bytes_read);
    read_buffers[ep_logic_index] = NULL;
    read_sizes[ep_logic_index] = 0;
    return bytes_read;
}

bool USBPhyHw::endpoint_read_result_core(usb_ep_t endpoint, uint8_t *data, uint32_t size, uint32_t *bytes_read)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t i;
    uint8_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
    uint8_t *buf = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(ep_hw_index));
    uint32_t eprxcnt = USBD_GET_PAYLOAD_LEN(ep_hw_index);
    for (i = 0; i < eprxcnt; i ++)
        data[i] = buf[i];
    *bytes_read = eprxcnt;
    return true;
}

/*
  Start a write on the given endpoint.
  true if the data was prepared for transmit, false otherwise
*/
bool USBPhyHw::endpoint_write(usb_ep_t endpoint, uint8_t *data, uint32_t size)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);

    if(ep_logic_index == 0)
        return false;
    else
    {
        uint8_t *buf;
        uint32_t i=0;
        if(s_ep_compl & (1 << ep_logic_index))
            return false;

        s_ep_compl |= (1 << ep_logic_index);

        buf = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(ep_hw_index));

        for(i=0; i<size; i++)
            buf[i] = data[i];

        /* Set transfer length and trigger IN transfer */
        USBD_SET_PAYLOAD_LEN(ep_hw_index, size);
    }
    return true;
}

/* Abort the current transfer if it has not yet been sent. */
void USBPhyHw::endpoint_abort(usb_ep_t endpoint)
{
    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
    USBD_STOP_TRANSACTION(ep_hw_index);
    s_ep_compl &= ~(1 << ep_logic_index);
    s_ep_valid[ep_logic_index] = 0;
}

/*
  Callback used for performing USB processing.
  USBPhy processing should be triggered by calling USBPhyEvents::start_process and done inside process. All USBPhyEvents callbacks aside from USBPhyEvents::start_process must be called in the context of process
*/
void USBPhyHw::process()
{
//    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    uint32_t u32IntSts = USBD_GET_INT_FLAG();
    uint32_t u32State = USBD_GET_BUS_STATE();

#if defined (TARGET_NANO100)
    if(u32IntSts & USBD_INTSTS_FLD_STS_Msk)
#else
    if(u32IntSts & USBD_INTSTS_VBDETIF_Msk)
#endif
    {
        /* Floating detect */
#if defined (TARGET_NANO100)
        USBD_CLR_INT_FLAG(USBD_INTSTS_FLD_STS_Msk);
#else
        USBD_CLR_INT_FLAG(USBD_INTSTS_VBDETIF_Msk);
#endif
        if(USBD_IS_ATTACHED())
        {
            /* USB Plug In */
            USBD_ENABLE_USB();
        } else {
            /* USB Un-plug */
            USBD_DISABLE_USB();

            disconnect();
        }
    }

#if defined (TARGET_NANO100)
    if(u32IntSts & USBD_INTSTS_BUS_STS_Msk)
#else
    if(u32IntSts & USBD_INTSTS_BUSIF_Msk)
#endif
    {
        /* Clear event flag */
#if defined (TARGET_NANO100)
        USBD_CLR_INT_FLAG(USBD_INTSTS_BUS_STS_Msk);
        if(u32State & USBD_BUSSTS_USBRST_Msk)
#else
        USBD_CLR_INT_FLAG(USBD_INTSTS_BUSIF_Msk);
        if(u32State & USBD_ATTR_USBRST_Msk)
#endif
        {
            /* Bus reset */
            USBD_ENABLE_USB();

            USBD_SwReset();

            connect();
            events->reset();
        }

#if defined (TARGET_NANO100)
        if(u32State & USBD_BUSSTS_SUSPEND_Msk)
#else
        if(u32State & USBD_ATTR_SUSPEND_Msk)
#endif
        {
            /* Enable USB but disable PHY */
            USBD_DISABLE_PHY();
        }
#if defined (TARGET_NANO100)
        if(u32State & USBD_BUSSTS_RESUME_Msk)
#else
        if(u32State & USBD_ATTR_RESUME_Msk)
#endif
        {
            /* Enable USB and enable PHY */
            USBD_ENABLE_USB();
        }
    }

#if defined (TARGET_NANO100)
    if(u32IntSts & USBD_INTSTS_USB_STS_Msk)
#else
    if(u32IntSts & USBD_INTSTS_USBIF_Msk)
#endif
    {
        /* USB event */
        if(u32IntSts & USBD_INTSTS_SETUP_Msk)
        {
            /* Setup packet */
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_SETUP_Msk);
            /* Clear the data IN/OUT ready flag of control end-points */
            USBD_STOP_TRANSACTION(EP0);
            USBD_STOP_TRANSACTION(EP1);
            events->ep0_setup();
        }

        /* EP events */
        if(u32IntSts & USBD_INTSTS_EP0)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP0);
            /* Control IN */
            events->ep0_in();
            /* In ACK for Set address */
#if defined(TARGET_M480) || defined(TARGET_M451) || defined(TARGET_M460)
            if((g_usbd_SetupPacket[0] == REQ_STANDARD) && (g_usbd_SetupPacket[1] == USBD_SET_ADDRESS))
#else
            if((g_usbd_SetupPacket[0] == REQ_STANDARD) && (g_usbd_SetupPacket[1] == SET_ADDRESS))
#endif
            {
                if((USBD_GET_ADDR() != s_usb_addr) && (USBD_GET_ADDR() == 0))
                {
                    USBD_SET_ADDR(s_usb_addr);
                }
            }
        }
        if(u32IntSts & USBD_INTSTS_EP1)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP1);

            /* Control OUT */
            events->ep0_out();
        }

