ehunck/automatic-midi-bells/USBPhy_M252.cpp
        uint32_t gintsts_epx = (u32IntSts >> 18) & 0x3F;
        uint32_t ep_hw_index = 2;
        while (gintsts_epx)
        {
            if(gintsts_epx & 0x01)
            {
                uint32_t ep_status;
#if defined(TARGET_M451)
                ep_status = (USBD->EPSTS >> (ep_hw_index * 3 + 8)) & 0x7;
#elif defined(TARGET_NANO100)
                if(ep_hw_index < 6)
                    ep_status = (USBD->EPSTS >> (ep_hw_index * 4 + 8)) & 0xF;
                else
                    ep_status = (USBD->EPSTS2 >> ((ep_hw_index - 6) * 4)) & 0x7;
#elif defined(TARGET_M480) || defined(TARGET_M2351) || defined(TARGET_M261)  || defined(TARGET_M460) || defined(TARGET_M2354)
                if(ep_hw_index < 8)
                    ep_status = (USBD->EPSTS0 >> (ep_hw_index * 4)) & 0xF;
                else
                    ep_status = (USBD->EPSTS1 >> ((ep_hw_index - 8) * 4)) & 0xF;
#endif
                /* Clear event flag */
                USBD_CLR_INT_FLAG(1 << (ep_hw_index + 16));

                if(ep_status == 0x02 || ep_status == 0x06 || (ep_status == 0x07 && (ep_hw_index & 0x01) == 1))
                {   /* RX */
                    s_ep_compl &= ~(1 << (NU_EPH2EPL(ep_hw_index)));
                    if(s_ep_valid[NU_EPH2EPL(ep_hw_index)])
                        events->out(HW_TO_DESC(ep_hw_index));
                    s_ep_valid[NU_EPH2EPL(ep_hw_index)] = 1;
                }
                else if(ep_status == 0x00 || ep_status == 0x07)
                {   /* TX */
                    s_ep_compl &= ~(1 << (NU_EPH2EPL(ep_hw_index)));
                    if(s_ep_valid[NU_EPH2EPL(ep_hw_index)])
                        events->in(HW_TO_DESC(ep_hw_index));
                    s_ep_valid[NU_EPH2EPL(ep_hw_index)] = 1;
                }
            }
            gintsts_epx = gintsts_epx >> 1;
            ep_hw_index++;
        }
    }
}

extern "C" void USBD_IRQHandler(void)
{
//    NVT_USB_Debug(("### %s[%d]\n", __FUNCTION__, __LINE__));
    instance->events->start_process();
}
#else
/* USB 2.0 Engine */
static volatile int epComplete = 0;

// Conversion macros
#define DESC_TO_LOG(endpoint)   ((endpoint) & 0xF)
#define NU_EPH2EPL(ep)          ((ep) + 1)
#define NU_EPL2EPH(ep)          (ep - 1)

#define EP_DIR_Msk        0x80
#define EP_DIR_OUT        0x00
#define EP_DIR_IN         0x80

#if defined (TARGET_M480) || defined (TARGET_M460)
#define HSUSBD_GET_EP_MAX_PAYLOAD(ep)     HSUSBD->EP[ep].EPMPS
#define HSUSBD_GET_EP_DATA_COUNT(ep)      (HSUSBD->EP[ep].EPDATCNT & 0xFFFFF)
#define HSUSBD_SET_EP_SHORT_PACKET(ep)    HSUSBD->EP[ep].EPRSPCTL = ((HSUSBD->EP[ep].EPRSPCTL & 0x10) | 0x40)
#define HSUSBD_GET_EP_INT_EN(ep)          HSUSBD->EP[ep].EPINTEN
#elif defined (TARGET_NUC472)
#define USBD_GET_EP_MAX_PAYLOAD(ep)       *((__IO uint32_t *) ((uint32_t)&USBD->EPAMPS + (uint32_t)(ep*0x28)))
#define USBD_GET_EP_DATA_COUNT(ep)        *((__IO uint32_t *) ((uint32_t)&USBD->EPADATCNT + (uint32_t)(ep*0x28)))
#define USBD_SET_EP_SHORT_PACKET(ep)      *((__IO uint32_t *) ((uint32_t)&USBD->EPARSPCTL + (uint32_t)(ep*0x28))) = ((*((__IO uint32_t *)((uint32_t)&USBD->EPARSPCTL+(uint32_t)(ep*0x28))) & 0x10) | 0x40)
#define USBD_SET_EP_BUF_FLUSH(ep)         *((__IO uint32_t *) ((uint32_t)&USBD->EPARSPCTL + (uint32_t)(ep*0x28))) = USBD_EPRSPCTL_FLUSH_Msk
#define USBD_GET_EP_INT_EN(ep)            *((__IO uint32_t *) ((uint32_t)&USBD->EPAINTEN  + (uint32_t)(ep*0x28)))
#define USBD_GET_EP_INT(ep)               *((__IO uint32_t *) ((uint32_t)&USBD->EPAINTSTS + (uint32_t)(ep*0x28)))
#define USBD_CLR_EP_INT(ep, intr)        (*((__IO uint32_t *) ((uint32_t)&USBD->EPAINTSTS + (uint32_t)(ep*0x28))) = (intr)) /*!<Enable EPx Interrupt  \hideinitializer */
#endif

static volatile uint32_t s_ep_compl = 0;
static volatile uint32_t s_ep_buf_ind = 0;
static volatile uint32_t s_ep0_max_packet_size = 64;
static volatile uint8_t s_usb_addr = 0;

#if defined (TARGET_M480) || defined (TARGET_M460)
static volatile S_HSUSBD_CMD_T s_setup;
#elif defined (TARGET_NUC472)
static volatile S_USBD_CMD_T s_setup;
#endif

static volatile uint16_t s_ctrlin_packetsize;
static volatile uint8_t *g_usbd_CtrlInPointer = 0;
static uint32_t g_usbd_CtrlMaxPktSize = 64;
static volatile uint32_t g_usb_CtrlInSize = 0;
static uint32_t g_usb_ShortPacket = 0;
static uint32_t gEpReadCnt = 0;
static uint8_t set_addr = 0;

#if defined (TARGET_NUC472)
void USBD_CtrlInput(void)
{
    unsigned volatile i;
    uint32_t volatile count;

    if(g_usb_CtrlInSize >= g_usbd_CtrlMaxPktSize)
    {
        for (i=0; i<g_usbd_CtrlMaxPktSize; i++)
            USBD->CEPDAT_BYTE = *(uint8_t *)(g_usbd_CtrlInPointer++);
        USBD->CEPTXCNT = g_usbd_CtrlMaxPktSize;
        g_usb_CtrlInSize -= g_usbd_CtrlMaxPktSize;
    }
    else
    {
        for (i=0; i<g_usb_CtrlInSize; i++)
            USBD->CEPDAT_BYTE = *(uint8_t *)(g_usbd_CtrlInPointer++);
        USBD->CEPTXCNT = g_usb_CtrlInSize;
        g_usbd_CtrlInPointer = 0;
        g_usb_CtrlInSize = 0;
    }
}
#elif defined (TARGET_M480) || defined (TARGET_M460)
void HSUSBD_CtrlInput(void)
{
    unsigned volatile i;
    uint32_t volatile count;

    /*************************** Enable Buffer ***************************/
    HSUSBD_SetEpBufAddr(CEP, 0, s_ep0_max_packet_size);
    if(g_usb_CtrlInSize >= g_usbd_CtrlMaxPktSize)
    {
        for (i=0; i<g_usbd_CtrlMaxPktSize; i++)
            HSUSBD->CEPDAT_BYTE = *(uint8_t *)(g_usbd_CtrlInPointer++);
        HSUSBD->CEPTXCNT = g_usbd_CtrlMaxPktSize;
        g_usb_CtrlInSize -= g_usbd_CtrlMaxPktSize;
    }
    else
    {
        for (i=0; i<g_usb_CtrlInSize; i++)
            HSUSBD->CEPDAT_BYTE = *(uint8_t *)(g_usbd_CtrlInPointer++);
        HSUSBD->CEPTXCNT = g_usb_CtrlInSize;
        g_usbd_CtrlInPointer = 0;
        g_usb_CtrlInSize = 0;
    }
}
#endif

USBPhy *get_usb_phy()
{
    static USBPhyHw usbphy;
    return &usbphy;
}


USBPhyHw::USBPhyHw(): events(NULL)
{
}

USBPhyHw::~USBPhyHw()
{
}

