ehunck/automatic-midi-bells/USBPhy_M252.cpp
/*
  Initialize this USBPhy instance.
  This function must be called before calling any other functions of this class, unless specifically noted.
*/
void USBPhyHw::init(USBPhyEvents *events)
{
    if (this->events == NULL)
        sleep_manager_lock_deep_sleep();

    this->events = events;

    SYS_UnlockReg();

    s_ep_buf_ind = 0;

    chip_config();

#if defined (TARGET_NUC472)

    USBD_ENABLE_PHY();

    while (1)
    {
        USBD->EPAMPS = 0x20;
        if (USBD->EPAMPS == 0x20)
            break;
    }

    /* Set SE0 (disconnect) */
    USBD_SET_SE0();

    NVIC_SetVector(USBD_IRQn, (uint32_t) &USBD_IRQHandler);
    NVIC_EnableIRQ(USBD_IRQn);

#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD_ENABLE_PHY();

    while (1)
    {
        HSUSBD->EP[0].EPMPS = 0x20;
        if (HSUSBD->EP[0].EPMPS == 0x20)
            break;
    }

    /* Set SE0 (disconnect) */
    HSUSBD_SET_SE0();

    NVIC_SetVector(USBD20_IRQn, (uint32_t) &USBD_IRQHandler);
    NVIC_EnableIRQ(USBD20_IRQn);
#endif

    instance = this;
}

void USBPhyHw::deinit()
{
    disconnect();

#if defined (TARGET_NUC472)

    NVIC_DisableIRQ(USBD_IRQn);

    USBD_SET_SE0();
    USBD_DISABLE_PHY();

#elif defined (TARGET_M480) || defined (TARGET_M460)

    NVIC_DisableIRQ(USBD20_IRQn);

    HSUSBD_SET_SE0();
    HSUSBD_DISABLE_PHY();

#endif

    if (events != NULL)
    {
        sleep_manager_unlock_deep_sleep();
    }
    events = NULL;
}

/*
  Check if USB power is present.
  Devices which don't support checking the USB power state must always return true.
*/
bool USBPhyHw::powered()
{
    return true;
}

void USBPhyHw::connect()
{
    memset(read_buffers, 0, sizeof(read_buffers));
    memset(read_sizes, 0, sizeof(read_sizes));

#if defined (TARGET_NUC472)
    USBD_ResetDMA();
    USBD_SET_ADDR(0);

    /**
      * Control Transfer Packet Size Constraints
      * low-speed: 8
      * full-speed: 8, 16, 32, 64
      * high-speed: 64
      */
    /* Control endpoint */
    USBD_SetEpBufAddr(CEP, 0, s_ep0_max_packet_size);
    s_ep_buf_ind = s_ep0_max_packet_size;

    /* Enable USB/CEP interrupt */
    USBD_ENABLE_USB_INT(USBD_GINTEN_USBIE_Msk | USBD_GINTEN_CEPIE_Msk);
    USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk| USBD_CEPINTEN_STSDONEIEN_Msk);

    /* Enable BUS interrupt */
    USBD_ENABLE_BUS_INT(
        USBD_BUSINTEN_RESUMEIEN_Msk |
        USBD_BUSINTEN_RSTIEN_Msk |
        USBD_BUSINTEN_VBUSDETIEN_Msk
    );

    /* Clear SE0 (connect) */
    USBD_CLR_SE0();

#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD_ResetDMA();
    HSUSBD_SET_ADDR(0);

    /**
      * Control Transfer Packet Size Constraints
      * low-speed: 8
      * full-speed: 8, 16, 32, 64
      * high-speed: 64
      */
    /* Control endpoint */
    /*************************** Disable Buffer ***************************/
    HSUSBD_SetEpBufAddr(CEP, 0, 1);
    s_ep_buf_ind = s_ep0_max_packet_size;

    /* Enable USB/CEP interrupt */
    HSUSBD_ENABLE_USB_INT(HSUSBD_GINTEN_USBIEN_Msk | HSUSBD_GINTEN_CEPIEN_Msk);
    HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPTKIEN_Msk|HSUSBD_CEPINTEN_SETUPPKIEN_Msk|HSUSBD_CEPINTEN_STSDONEIEN_Msk);

    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(
        HSUSBD_BUSINTEN_RESUMEIEN_Msk |
        HSUSBD_BUSINTEN_RSTIEN_Msk |
        HSUSBD_BUSINTEN_VBUSDETIEN_Msk
    );

    /* Clear SE0 (connect) */
    HSUSBD_CLR_SE0();
#endif
}

/* Make the USB phy visible to the USB host.
   Enable either the D+ or D- pullup so the host can detect the presence of this device. */
void USBPhyHw::disconnect()
{
    /* Set SE0 (disconnect) */
#if defined (TARGET_NUC472)
    USBD_SET_SE0();
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD_SET_SE0();
#endif
}

/* Set this device to the configured state.
   Enable added endpoints if they are not enabled already. */
void USBPhyHw::configure()
{
    // not needed
}

/*
   Leave the configured state.
   This is a notification to the USBPhy indicating that the device is leaving the configured state. The USBPhy can disable all endpoints other than endpoint 0.
*/
void USBPhyHw::unconfigure()
{
    s_ep_buf_ind = s_ep0_max_packet_size;
}

/* Enable the start of frame interrupt. */
void USBPhyHw::sof_enable()
{
#if defined (TARGET_NUC472)
    USBD->BUSINTEN |= USBD_BUSINTEN_SOFIEN_Msk;
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD->BUSINTEN |= HSUSBD_BUSINTEN_SOFIEN_Msk;
#endif
}

/* Disable the start of frame interrupt. */
void USBPhyHw::sof_disable()
{
#if defined (TARGET_NUC472)
    USBD->BUSINTEN &= ~USBD_BUSINTEN_SOFIEN_Msk;
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD->BUSINTEN &= ~HSUSBD_BUSINTEN_SOFIEN_Msk;
#endif
}

/* Set the USBPhy's address. */
void USBPhyHw::set_address(uint8_t address)
{
    s_usb_addr = address;
}

/* Wake upstream devices */
void USBPhyHw::remote_wakeup()
{
#if defined (TARGET_NUC472)
    USBD->OPER |= USBD_OPER_RESUMEEN_Msk;
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD->OPER |= HSUSBD_OPER_RESUMEEN_Msk;
#endif
}

/*
  Get the endpoint table.
  This function returns a table which describes the endpoints can be used, the functionality of those endpoints and the resource cost.
*/
const usb_ep_table_t *USBPhyHw::endpoint_table()
{
    static const usb_ep_table_t endpoint_table = {
        1, // No cost per endpoint - everything allocated up front
        {
            {USB_EP_ATTR_ALLOW_CTRL | USB_EP_ATTR_DIR_IN_AND_OUT, 0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_IN ,         0, 0},
            {ALLOW_ALL_EXCEPT_CRTL | USB_EP_ATTR_DIR_OUT,         0, 0},
            {ALLOW_NO_ENDPOINTS | USB_EP_ATTR_DIR_IN,             0, 0},
            {ALLOW_NO_ENDPOINTS | USB_EP_ATTR_DIR_OUT,            0, 0},
            {ALLOW_NO_ENDPOINTS | USB_EP_ATTR_DIR_IN,             0, 0}
        }
    };
    return &endpoint_table;
}
/*
  Set wMaxPacketSize of endpoint 0.
 */
uint32_t USBPhyHw::ep0_set_max_packet(uint32_t max_packet)
{
    s_ep0_max_packet_size = max_packet;
    return s_ep0_max_packet_size;
}

/* Read the contents of the SETUP packet. */
void USBPhyHw::ep0_setup_read_result(uint8_t *buffer, uint32_t size)
{
#if defined (TARGET_NUC472)
    *((uint16_t *) (buffer + 0)) = (uint16_t) USBD->SETUP1_0;
    *((uint16_t *) (buffer + 2)) = (uint16_t) USBD->SETUP3_2;
    *((uint16_t *) (buffer + 4)) = (uint16_t) USBD->SETUP5_4;
    *((uint16_t *) (buffer + 6)) = (uint16_t) USBD->SETUP7_6;

    s_setup.bmRequestType = (uint8_t) (USBD->SETUP1_0 & 0xff);
    s_setup.bRequest = (int8_t) (USBD->SETUP1_0 >> 8) & 0xff;
    s_setup.wValue = (uint16_t) USBD->SETUP3_2;
    s_setup.wIndex = (uint16_t) USBD->SETUP5_4;
    s_setup.wLength = (uint16_t) USBD->SETUP7_6;
#elif defined (TARGET_M480) || defined (TARGET_M460)
    *((uint16_t *) (buffer + 0)) = (uint16_t) HSUSBD->SETUP1_0;
    *((uint16_t *) (buffer + 2)) = (uint16_t) HSUSBD->SETUP3_2;
    *((uint16_t *) (buffer + 4)) = (uint16_t) HSUSBD->SETUP5_4;
    *((uint16_t *) (buffer + 6)) = (uint16_t) HSUSBD->SETUP7_6;

