ehunck/automatic-midi-bells/USBPhy_M252.cpp
    s_setup.bmRequestType = (uint8_t) (HSUSBD->SETUP1_0 & 0xff);
    s_setup.bRequest = (int8_t) (HSUSBD->SETUP1_0 >> 8) & 0xff;
    s_setup.wValue = (uint16_t) HSUSBD->SETUP3_2;
    s_setup.wIndex = (uint16_t) HSUSBD->SETUP5_4;
    s_setup.wLength = (uint16_t) HSUSBD->SETUP7_6;
#endif
}

/*
  Start receiving a packet of up to wMaxPacketSize on endpoint 0.
*/
void USBPhyHw::ep0_read(uint8_t *data, uint32_t size)
{
#if defined (TARGET_NUC472)
    if (s_setup.wLength && ! (s_setup.bmRequestType & 0x80))
    {
        /* Control OUT */
        read_buffers[0] = data;
        read_sizes[0] = size;
        USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk | USBD_CEPINTEN_RXPKIEN_Msk);
    }
    else
    {
        /* Status stage */
        USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_STSDONEIF_Msk);
        USBD_SET_CEP_STATE(USB_CEPCTL_NAKCLR);
        USBD_ENABLE_CEP_INT(USBD_CEPINTEN_STSDONEIEN_Msk|USBD_CEPINTEN_INTKIEN_Msk);
    }
#elif defined (TARGET_M480) || defined (TARGET_M460)
    if (s_setup.wLength && ! (s_setup.bmRequestType & 0x80))
    {
        /* Control OUT */
        read_buffers[0] = data;
        read_sizes[0] = size;
        HSUSBD->CEPINTSTS = HSUSBD_CEPINTSTS_NAKIF_Msk;
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPTKIEN_Msk|HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_RXPKIEN_Msk | HSUSBD_CEPINTEN_NAKIEN_Msk);
    }
    else
    {
        /* Status stage */
        HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
        HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk|HSUSBD_CEPINTEN_INTKIEN_Msk);
        /*************************** Disable Buffer ***************************/
        HSUSBD_SetEpBufAddr(CEP, 0, 1);
    }
#endif
}
/*
  Read the contents of a received packet.
*/
uint32_t USBPhyHw::ep0_read_result()
{
    uint32_t i;
    uint8_t *ep0_data = read_buffers[0];
#if defined (TARGET_NUC472)
    uint32_t ceprxcnt = USBD->CEPRXCNT;

    for (i = 0; i < ceprxcnt; i ++)
        ep0_data[i] = USBD->CEPDAT_BYTE;
#elif defined (TARGET_M480) || defined (TARGET_M460)
    uint32_t ceprxcnt = HSUSBD->CEPRXCNT;

    for (i = 0; i < ceprxcnt; i ++)
        ep0_data[i] = HSUSBD->CEPDAT_BYTE;
#endif
    return ceprxcnt;
}

/* Write a packet on endpoint 0. */
void USBPhyHw::ep0_write(uint8_t *buffer, uint32_t size)
{
#if defined (TARGET_NUC472)
    if (buffer && size)
    {
        g_usbd_CtrlInPointer = buffer;
        g_usb_CtrlInSize = size;
        USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_INTKIF_Msk);
        USBD_ENABLE_CEP_INT(USBD_CEPINTEN_INTKIEN_Msk);
    }
    else
    {
        /* Status stage */
        USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_STSDONEIF_Msk);
        USBD_SET_CEP_STATE(USB_CEPCTL_NAKCLR);
        USBD_ENABLE_CEP_INT(USBD_CEPINTEN_STSDONEIEN_Msk);
    }
#elif defined (TARGET_M480) || defined (TARGET_M460)
    if (buffer && size)
    {
        g_usbd_CtrlInPointer = buffer;
        g_usb_CtrlInSize = size;
        HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk);
    }
    else
    {
        /* Status stage */
        HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
        HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
        HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
    }
#endif
}

void stallEndpoint(uint8_t endpoint)
{
    uint32_t ep_hw_index = NU_EPL2EPH(endpoint);
    if (ep_hw_index >= NUMBER_OF_PHYSICAL_ENDPOINTS)
        return;
#if defined (TARGET_NUC472)
    USBD_SetStall(ep_hw_index);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD_SetStall(ep_hw_index);
#endif
}

/* Protocol stall on endpoint 0.
   Stall all IN and OUT packets on endpoint 0 until a setup packet is received.
   Note The stall is cleared automatically when a setup packet is received
*/
void USBPhyHw::ep0_stall()
{
#if defined (TARGET_NUC472)
    USBD_SetStall(0);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD_SetStall(0);
#endif
}

/* Configure and enable an endpoint. */
/*
   endpoint	Endpoint to configure and enable
   max_packet	The maximum packet size that can be sent or received
   type	The type of endpoint this should be configured as - USB_EP_TYPE_BULK, USB_EP_TYPE_INT or USB_EP_TYPE_ISO
   This function cannot be used to configure endpoint 0. That must be done with ep0_set_max_packet
*/
bool USBPhyHw::endpoint_add(usb_ep_t endpoint, uint32_t max_packet, usb_ep_type_t type)
{
    uint32_t ep_type;
    uint32_t ep_hw_index = NU_EPL2EPH(DESC_TO_LOG(endpoint));

#if defined (TARGET_NUC472)
    USBD_SetEpBufAddr(ep_hw_index, s_ep_buf_ind, max_packet);
    s_ep_buf_ind += max_packet;
    USBD_SET_MAX_PAYLOAD(ep_hw_index, max_packet);
    switch (type)
    {
        case USB_EP_TYPE_INT:
            ep_type = USB_EP_CFG_TYPE_INT;
            break;

        case USB_EP_TYPE_ISO:
            ep_type = USB_EP_CFG_TYPE_ISO;
            break;

        default:
            ep_type = USB_EP_CFG_TYPE_BULK;
    }

    uint32_t ep_dir = ((endpoint & EP_DIR_Msk) == EP_DIR_IN) ? USB_EP_CFG_DIR_IN : USB_EP_CFG_DIR_OUT;
    USBD_ConfigEp(ep_hw_index, DESC_TO_LOG(endpoint), ep_type, ep_dir);

    /* Enable USB/EPX interrupt */
    // NOTE: Require USBD_GINTEN_EPAIE_Pos, USBD_GINTEN_EPBIE_Pos, ... USBD_GINTEN_EPLIE_Pos to be consecutive.
    USBD_ENABLE_USB_INT(USBD->GINTEN | USBD_GINTEN_USBIE_Msk |
                          USBD_GINTEN_CEPIE_Msk |
                          1 << (ep_hw_index  + USBD_GINTEN_EPAIE_Pos));

    if (ep_dir != 0)
        USBD_ENABLE_EP_INT(ep_hw_index, USBD_EPINTEN_TXPKIEN_Msk);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD_SetEpBufAddr(ep_hw_index, s_ep_buf_ind, max_packet);
    s_ep_buf_ind += max_packet;
    HSUSBD_SET_MAX_PAYLOAD(ep_hw_index, max_packet);
    switch (type)
    {
        case USB_EP_TYPE_INT:
            ep_type = HSUSBD_EP_CFG_TYPE_INT;
            break;

        case USB_EP_TYPE_ISO:
            ep_type = HSUSBD_EP_CFG_TYPE_ISO;
            break;

        default:
            ep_type = HSUSBD_EP_CFG_TYPE_BULK;
    }

    uint32_t ep_dir = ((endpoint & EP_DIR_Msk) == EP_DIR_IN) ? HSUSBD_EP_CFG_DIR_IN : HSUSBD_EP_CFG_DIR_OUT;
    HSUSBD_ConfigEp(ep_hw_index, DESC_TO_LOG(endpoint), ep_type, ep_dir);

