ehunck/automatic-midi-bells/USBPhy_M252.cpp
    /* Enable USB/EPX interrupt */
    // NOTE: Require USBD_GINTEN_EPAIE_Pos, USBD_GINTEN_EPBIE_Pos, ... USBD_GINTEN_EPLIE_Pos to be consecutive.
    HSUSBD_ENABLE_USB_INT(HSUSBD->GINTEN | HSUSBD_GINTEN_USBIEN_Msk |
                          HSUSBD_GINTEN_CEPIEN_Msk |
                          1 << (ep_hw_index  + HSUSBD_GINTEN_EPAIEN_Pos));
#endif
     return true;
}

void USBPhyHw::endpoint_remove(usb_ep_t endpoint)
{
    uint32_t ep_hw_index = NU_EPL2EPH(DESC_TO_LOG(endpoint));
#if defined (TARGET_NUC472)
    *((__IO uint32_t *) ((uint32_t)&USBD->EPACFG + (uint32_t)(ep_hw_index*0x28))) = (*((__IO uint32_t *)((uint32_t)&USBD->EPACFG+(uint32_t)(ep_hw_index*0x28))) & ~USB_EP_CFG_VALID);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD->EP[ep_hw_index].EPCFG = HSUSBD->EP[ep_hw_index].EPCFG  & ~HSUSBD_EP_CFG_VALID;
#endif
}

/*
  Perform a functional stall on the given endpoint.
  Set the HALT feature for this endpoint so that all further communication is aborted.
*/
void USBPhyHw::endpoint_stall(usb_ep_t endpoint)
{
    uint8_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
#if defined (TARGET_NUC472)
    if(ep_logic_index == 0)
        USBD_SetStall(0);
    else
        USBD_SetStall(ep_logic_index);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    if(ep_logic_index == 0)
        HSUSBD_SetEpStall(CEP);
    else
        HSUSBD_SetEpStall(ep_hw_index);
#endif
}

/*
   Unstall the endpoint.
   Clear the HALT feature on this endpoint so communication can resume.
 */
void USBPhyHw::endpoint_unstall(usb_ep_t endpoint)
{
    uint8_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
#if defined (TARGET_NUC472)
    if(ep_logic_index != 0)
        USBD_ClearStall(ep_logic_index);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    if(ep_logic_index != 0)
        HSUSBD_ClearEpStall(ep_hw_index);
#endif
}

/* Start a read on the given endpoint. */
bool USBPhyHw::endpoint_read(usb_ep_t endpoint, uint8_t *data, uint32_t size)
{
/* Store the buffer address & length */
    uint8_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
    read_buffers[ep_logic_index] = data;
    read_sizes[ep_logic_index] = size;
#if defined (TARGET_NUC472)
    USBD_ENABLE_EP_INT(ep_hw_index, USBD_GET_EP_INT_EN(ep_hw_index) | USBD_EPINTEN_RXPKIEN_Msk);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    HSUSBD->EP[ep_hw_index].EPINTEN |= HSUSBD_EPINTEN_RXPKIEN_Msk;
#endif
    return true;
}

/*
  Finish a read on the given endpoint
  Returns The number of bytes received
*/
uint32_t USBPhyHw::endpoint_read_result(usb_ep_t endpoint)
{
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t bytes_read = 0;
    endpoint_read_result_core(endpoint, read_buffers[ep_logic_index], read_sizes[ep_logic_index], &bytes_read);
    read_buffers[ep_logic_index] = 0;
    read_sizes[ep_logic_index] = 0;
    return bytes_read;
}

bool USBPhyHw::endpoint_read_result_core(usb_ep_t endpoint, uint8_t *data, uint32_t size, uint32_t *bytes_read)
{
    uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
    uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
    uint8_t __attribute__((aligned(4))) tmp_buffer[4];
    uint32_t volatile buffer, len, i;
#if defined (TARGET_NUC472)
    uint32_t mps = USBD_GET_EP_MAX_PAYLOAD(ep_hw_index);

    gEpReadCnt = USBD_GET_EP_DATA_COUNT(ep_hw_index);
#elif defined (TARGET_M480) || defined (TARGET_M460)
    uint32_t mps = HSUSBD_GET_EP_MAX_PAYLOAD(ep_hw_index);

    gEpReadCnt = HSUSBD_GET_EP_DATA_COUNT(ep_hw_index);
#endif

    if(gEpReadCnt == 0)
    {
        *bytes_read = 0;
        return true;
    }

    buffer = (uint32_t)data;

    if(buffer % 4)
    {
        len = 4 - (buffer % 4);
        if(gEpReadCnt <= len)
            len = gEpReadCnt;

        while(1)
        {
#if defined (TARGET_NUC472)
            if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
                break;
            else if (!USBD_IS_ATTACHED())
                break;
#elif defined (TARGET_M480) || defined (TARGET_M460)
            if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
                break;
            else if (!HSUSBD_IS_ATTACHED())
                break;
#endif
        }
#if defined (TARGET_NUC472)
        USBD_SET_DMA_LEN(len);
        USBD_SET_DMA_ADDR((uint32_t)tmp_buffer);
        USBD_SET_DMA_WRITE(ep_logic_index);
        USBD_ENABLE_DMA();
#elif defined (TARGET_M480) || defined (TARGET_M460)
        HSUSBD_SET_DMA_LEN(len);
        HSUSBD_SET_DMA_ADDR((uint32_t)tmp_buffer);
        HSUSBD_SET_DMA_WRITE(ep_logic_index);
        HSUSBD_ENABLE_DMA();
#endif

        while(1)
        {
#if defined (TARGET_NUC472)
            if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
                break;
            else if (!USBD_IS_ATTACHED())
                break;
#elif defined (TARGET_M480) || defined (TARGET_M460)
            if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
                break;
            else if (!HSUSBD_IS_ATTACHED())
                break;
#endif
        }
        for(i=0;i<len;i++)
            data[i] = tmp_buffer[i];

        buffer = buffer + len;
        len = gEpReadCnt - len;
    }
    else
        len = gEpReadCnt;

    if(len)
    {
#if defined (TARGET_NUC472)
        USBD_SET_DMA_LEN(len);
        USBD_SET_DMA_ADDR(buffer);
        USBD_SET_DMA_WRITE(ep_logic_index);
        USBD_ENABLE_DMA();
        while(1)
        {
            if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
                break;
            else if (!USBD_IS_ATTACHED())
                break;
        }
#elif defined (TARGET_M480) || defined (TARGET_M460)
        HSUSBD_SET_DMA_LEN(len);
        HSUSBD_SET_DMA_ADDR(buffer);
        HSUSBD_SET_DMA_WRITE(ep_logic_index);
        HSUSBD_ENABLE_DMA();
        while(1)
        {
            if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
                break;
            else if (!HSUSBD_IS_ATTACHED())
                break;
        }
#endif

