ehunck/automatic-midi-bells/USBPhy_M252.cpp
    }
    *bytes_read = gEpReadCnt;
    return true;
}

/*
  Start a write on the given endpoint.
  true if the data was prepared for transmit, false otherwise
*/
bool USBPhyHw::endpoint_write(usb_ep_t endpoint, uint8_t *data, uint32_t size)
{
   uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
   uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
   uint8_t __attribute__((aligned(4))) tmp_buffer[4];

    if(ep_logic_index == 0)
        return false;
    else
    {
#if defined (TARGET_NUC472)
        uint32_t mps = USBD_GET_EP_MAX_PAYLOAD(ep_hw_index);
#elif defined (TARGET_M480) || defined (TARGET_M460)
        uint32_t mps = HSUSBD_GET_EP_MAX_PAYLOAD(ep_hw_index);
#endif

        uint32_t buffer, len, i;
        if (size > mps)
            return false;

#if defined (TARGET_NUC472)
        if(USBD_GET_EP_DATA_COUNT(ep_hw_index) & 0xFFFF)
        {
            USBD_SET_EP_SHORT_PACKET(ep_hw_index);
            return false;
        }
#elif defined (TARGET_M480) || defined (TARGET_M460)
        if(HSUSBD->EP[ep_hw_index].EPDATCNT & 0xFFFF)
        {
            HSUSBD_SET_EP_SHORT_PACKET(ep_hw_index);
            return false;
        }
#endif

        if(size < mps)
            g_usb_ShortPacket = 1;

        while(1)
        {
#if defined (TARGET_NUC472)
            if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
                break;
            else if (!USBD_IS_ATTACHED())
                break;
#elif defined (TARGET_M480) || defined (TARGET_M460)
            if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
                break;
            else if (!HSUSBD_IS_ATTACHED())
                break;
#endif
        }
        buffer = (uint32_t)data;
        if(buffer % 4)
        {
            len = 4 - (buffer % 4);
            if(size <= len)
                len = size;

            for(i=0;i<len;i++)
                tmp_buffer[i] = data[i];

#if defined (TARGET_NUC472)
            USBD_SET_DMA_LEN(len);
            USBD_SET_DMA_ADDR((uint32_t)tmp_buffer);
            USBD_SET_DMA_READ(ep_logic_index);
            USBD_ENABLE_DMA();
            while(1)
            {
                if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
                    break;
                else if (!USBD_IS_ATTACHED())
                    break;
            }
#elif defined (TARGET_M480) || defined (TARGET_M460)
            HSUSBD_SET_DMA_LEN(len);
            HSUSBD_SET_DMA_ADDR((uint32_t)tmp_buffer);
            HSUSBD_SET_DMA_READ(ep_logic_index);
            HSUSBD_ENABLE_DMA();
            while(1)
            {
                if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
                    break;
                else if (!HSUSBD_IS_ATTACHED())
                    break;
            }
#endif
            buffer = buffer + len;
            len = size - len;
        }
        else
            len = size;

        if(len)
        {
#if defined (TARGET_NUC472)
            USBD_SET_DMA_LEN(len);
            USBD_SET_DMA_ADDR((uint32_t)buffer);
            USBD_SET_DMA_READ(ep_logic_index);
            USBD_ENABLE_DMA();
            while(1)
            {
                if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
                    break;
                else if (!USBD_IS_ATTACHED())
                    break;
            }
#elif defined (TARGET_M480) || defined (TARGET_M460)
            HSUSBD_SET_DMA_LEN(len);
            HSUSBD_SET_DMA_ADDR((uint32_t)buffer);
            HSUSBD_SET_DMA_READ(ep_logic_index);
            HSUSBD_ENABLE_DMA();
            while(1)
            {
                if (!(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
                    break;
                else if (!HSUSBD_IS_ATTACHED())
                    break;
            }
#endif
        }

#if defined (TARGET_NUC472)
        if(g_usb_ShortPacket)
            USBD_SET_EP_SHORT_PACKET(ep_hw_index);
    USBD_ENABLE_EP_INT(ep_hw_index, USBD_GET_EP_INT_EN(ep_hw_index) | USBD_EPINTEN_TXPKIEN_Msk);
#elif defined (TARGET_M480) || defined (TARGET_M460)
        if(g_usb_ShortPacket)
            HSUSBD_SET_EP_SHORT_PACKET(ep_hw_index);
    HSUSBD->EP[ep_hw_index].EPINTEN |= HSUSBD_EPINTEN_TXPKIEN_Msk;
#endif
    }
    return true;
}

/* Abort the current transfer if it has not yet been sent. */
void USBPhyHw::endpoint_abort(usb_ep_t endpoint)
{
   uint32_t ep_logic_index = DESC_TO_LOG(endpoint);
   uint32_t ep_hw_index = NU_EPL2EPH(ep_logic_index);
#if defined (TARGET_NUC472)
   USBD_CLR_EP_INT(ep_hw_index, USBD_GET_EP_INT(ep_hw_index));
   USBD_ENABLE_EP_INT(ep_hw_index, 0);
   USBD_SET_EP_BUF_FLUSH(ep_hw_index);
#elif defined (TARGET_M480) || defined (TARGET_M460)
   HSUSBD->EP[ep_hw_index].EPINTEN = 0;
   HSUSBD->EP[ep_hw_index].EPINTSTS = HSUSBD->EP[ep_hw_index].EPINTSTS;
   HSUSBD->EP[ep_hw_index].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
#endif
}

/*
  Callback used for performing USB processing.
  USBPhy processing should be triggered by calling USBPhyEvents::start_process and done inside process. All USBPhyEvents callbacks aside from USBPhyEvents::start_process must be called in the context of process
*/
void USBPhyHw::process()
{
#if defined (TARGET_NUC472)
    uint32_t gintsts = USBD->GINTSTS & USBD->GINTEN;
    uint32_t gintsts_epx = gintsts >> 2;     /* EPA, EPB, EPC, ... EPL interrupts */
    uint32_t ep_hw_index = 0;
    uint32_t ep_logic_index = 0,i;

    if (! gintsts)
        return;

    if (gintsts & USBD_GINTSTS_USBIF_Msk)
    {
        uint32_t busintsts = USBD->BUSINTSTS & USBD->BUSINTEN;

        /* SOF */
        if (busintsts & USBD_BUSINTSTS_SOFIF_Msk)
        {
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_SOFIF_Msk);

            events->sof(USBD->FRAMECNT >> 3);
        }

        /* Reset */
        if (busintsts & USBD_BUSINTSTS_RSTIF_Msk)
        {
            connect();
            events->reset();
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_RSTIF_Msk);
            USBD_CLR_CEP_INT_FLAG(0x1ffc);
        }

        /* Resume */
        if (busintsts & USBD_BUSINTSTS_RESUMEIF_Msk)
        {
            USBD_ENABLE_BUS_INT(USBD_BUSINTEN_RSTIEN_Msk | USBD_BUSINTEN_SUSPENDIEN_Msk);
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_RESUMEIF_Msk);
//            events->suspend(false);
        }

        /* Suspend */
        if (busintsts & USBD_BUSINTSTS_SUSPENDIF_Msk)
        {
            USBD_ENABLE_BUS_INT(USBD_BUSINTEN_RSTIEN_Msk | USBD_BUSINTEN_RESUMEIEN_Msk);
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_SUSPENDIF_Msk);
        }

        /* High-speed */
        if (busintsts & USBD_BUSINTSTS_HISPDIF_Msk)
        {
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk);
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_HISPDIF_Msk);
        }

        /* DMA */
        if (busintsts & USBD_BUSINTSTS_DMADONEIF_Msk)
        {
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_DMADONEIF_Msk);
        }

